<script setup>
import { ref } from "vue";
const contact = ref([
  {
    text: "رقم الاتصال",
    svg: {
      path: "M2.25 6.75c0 8.284 6.716 15 15 15h2.25a2.25 2.25 0 0 0 2.25-2.25v-1.372c0-.516-.351-.966-.852-1.091l-4.423-1.106c-.44-.11-.902.055-1.173.417l-.97 1.293c-.282.376-.769.542-1.21.38a12.035 12.035 0 0 1-7.143-7.143c-.162-.441.004-.928.38-1.21l1.293-.97c.363-.271.527-.734.417-1.173L6.963 3.102a1.125 1.125 0 0 0-1.091-.852H4.5A2.25 2.25 0 0 0 2.25 4.5v2.25Z",
      viewBox: "0 0 24 24 ",
    },
    content: "+963 11 218 1000",
  },
  {
    text: "البريد الإلكتروني",
    svg: {
      path: "M21.75 9v.906a2.25 2.25 0 0 1-1.183 1.981l-6.478 3.488M2.25 9v.906a2.25 2.25 0 0 0 1.183 1.981l6.478 3.488m8.839 2.51-4.66-2.51m0 0-1.023-.55a2.25 2.25 0 0 0-2.134 0l-1.022.55m0 0-4.661 2.51m16.5 1.615a2.25 2.25 0 0 1-2.25 2.25h-15a2.25 2.25 0 0 1-2.25-2.25V8.844a2.25 2.25 0 0 1 1.183-1.981l7.5-4.039a2.25 2.25 0 0 1 2.134 0l7.5 4.039a2.25 2.25 0 0 1 1.183 1.98V19.5Z",
      viewBox: "0 0 24 24 ",
    },
    content: "+@gmail.com",
  },
  {
    text: "الموقع",
    svg: {
      path: "M19.5 10.5c0 7.142-7.5 11.25-7.5 11.25S4.5 17.642 4.5 10.5a7.5 7.5 0 1 1 15 0Z",
      viewBox: "0 0 24 24 ",
    },

    content: "محمع الرئاسة ",
  },
  {
    text: "تيليجرام",
    svg: {
      path: "M17.5822 33.5652C17.5822 33.5652 36.2102 25.7194 42.6707 22.9567C45.1473 21.8518 53.546 18.3155 53.546 18.3155C53.546 18.3155 57.4224 16.7685 57.0993 20.5256C56.9916 22.0728 56.1302 27.4874 55.2688 33.3442C53.9767 41.6322 52.5769 50.6935 52.5769 50.6935C52.5769 50.6935 52.3615 53.2352 50.5311 53.6772C48.7006 54.1192 45.6856 52.1302 45.1473 51.6881C44.7165 51.3566 37.0715 46.3838 34.272 43.9527C33.5182 43.2897 32.6569 41.9637 34.3796 40.4166C38.256 36.7699 42.886 32.2392 45.6856 29.3661C46.9778 28.04 48.2698 24.9459 42.886 28.703C35.2411 34.1178 27.7038 39.201 27.7038 39.201C27.7038 39.201 25.9809 40.306 22.7507 39.3115C19.5203 38.317 15.7516 36.9909 15.7516 36.9909C15.7516 36.9909 13.1675 35.3334 17.5822 33.5652Z",
      viewBox: "0 0 70 70",
    },
    content: "@syriamofax",
  },
]);
</script>
<template>
  <section class="py-10 ">
    <h2
      class="text-background font-semibold text-2xl md:text-3xl lg:text-4xl leading-12 mb-0"
    >
      تواصل معنا
    </h2>
    <div class="grid grig-col-1 md:grid-cols-2 lg:grid-cols-4 gap-6 mt-10 mb-6">
      <div
        v-for="con in contact"
        :key="con.text"
        class="border border-Primary rounded-xl flex flex-col gap-6 justify-center items-center py-4"
      >
        <span class="text-Primary">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="none"
            :viewBox="con.svg.viewBox"
            stroke-width="1.5"
            stroke="currentColor"
            class="size-8"
            width="28"
            height="28"
          >
            <path
              stroke-linecap="round"
              stroke-linejoin="round"
              :d="con.svg.path"
            />
          </svg>
        </span>
        <p>{{ con.text }}</p>
        <span>{{ con.content }}</span>
      </div>
    </div>
    <p>
      لمشاركة آرائكم واقتراحاتكم وطلبات التواصل مع وزارة الخارجية والمغتربين
      يرجى تحميل تطبيق MOFA SY والتواصل معنا عبر الدعم الفني
    </p>
  </section>
</template>
